/*
 * 	for =================================> 157page
 * 	---반복문
 * 	--- 반복횟수를 알고 있는 경우에 주로 사용(Front-End)
 * 		1) 초기값 => 처음 시작값 지정	0
 * 		2) 조건식 => 범위(몇 번 수행)	10
 * 		3) 증감식 => i++, i+=2, i+=3.....
 * 						================ 복합 대입 연산자
 * 		=> for(초기값;조건식;증감식)
 * 			{
 * 				수행하는 문장
 * 				이미지를 출력
 * 				제목 출력
 * 				조회수...
 * 			}
 * 			
 * 			실행 순서	  | false(종료)
 * 				  1 → 2  ←  4
 * 			for(초기값;조건식;증감식)
 * 			{		  |true
 * 							↗
 * 				실행문장  3
 * 			}
 * 			============================
 * 			while : 반복횟수를 모르는 경우
 * 					데이터베이스 프로그램, 네트워크 (서버/클라이언트) => 무한루프(서버)
 * 				
 * 					초기값, 조건식, 증감식(for) => 형식에 차이
 * 			초기값 1
 * 				↑ 조건식에 대입 (true/false)
 * 			while(조건식) 2 =========================> false면 종료. true면 아래로 이동
 * 			{	
 * 					↓true
 * 				반복실행문장 3
 * 				증가식 4 ============>2번으로 이동(증가한 다음에 조건이 맞냐 아니냐 물어보러 가야함)
 * 			}
 * 			
 */
// 1~10 ==> 1증가하는 => 출력 => for/while (1~10까지 출력하는 프로그램 제작)
public class 반복문_for {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for(int i=1;i<=10;i++)
		{
			System.out.print(i+" ");
		}
		System.out.println(); //다음줄에 출력
		int i=1;
		while(i<=10)
		{
			System.out.print(i+" ");
			i++;
		}
		
	}

}
